const products = [
  {
    id: 1,
    title: "Банкетки",
    kg:"Отургучтар",
    price: 16000,
    images: [
        "images/Банкетки/Банкетка 1.jpg",
        "images/Банкетки/Банкетка 2.jpg",
        "images/Банкетки/Банкетка 3.jpg",
        "images/Банкетки/Банкетка 4.jpg",
        "images/Банкетки/Банкетка 5.jpg",
        "images/Банкетки/Банкетка 6.jpg",
        "images/Банкетки/Банкетка 7.jpg"
    ],
    description: "Мягкая банкетка для спальни, прихожей и зоны отдыха. Удобная конструкция и современный дизайн.",
descriptionKg: "Уктоочу бөлмө, коридор жана эс алуу аймагы үчүн жумшак банкетка. Ыңгайлуу түзүлүш жана заманбап дизайн.",

material: "Велюр, качественная ткань",
materialKg: "Велюр, сапаттуу кездеме",

frame: "Деревянный каркас, ЛДСП",
frameKg: "Жыгач каркас, ЛДСП",

style: "Современный",
styleKg: "Заманбап",

color: "Разные цвета на выбор",
colorKg: "Ар түрдүү түстөр тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
    keywords: ["банкетка", "банкетки"],

    seoTitle: "Банкетки в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Мягкая банкетка для спальни, прихожей и зоны отдыха. Удобная конструкция и современный дизайн.",
  },

  {
    id: 2,
    title: "Пуфы будуарные",
    kg:"Будуардук пуфтар",
    price: 16000,
    images: [
      "images/Пуфы будуарные/Пуф 1.jpg",
      "images/Пуфы будуарные/Пуф 2.jpg",
      "images/Пуфы будуарные/Пуф 3.jpg",
      "images/Пуфы будуарные/Пуф 4.jpg",
      "images/Пуфы будуарные/Пуф 5.jpg"
    ],
    description: "Элегантные будуарные пуфы для спальни и интерьера. Мягкое сиденье и стильная форма.",
descriptionKg: "Уктоочу бөлмө жана интерьер үчүн кооз будуардык пуфтар. Жумшак отургуч жана стилдүү форма.",

material: "Ткань, поролон",
materialKg: "Кездеме, поролон",

frame: "Прочный каркас",
frameKg: "Бекем каркас",

style: "Современный",
styleKg: "Заманбап",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
    keywords: ["пуф", "пуфы", "будуарный пуф", "будуарные пуфы"],

    seoTitle: "Пуфы будуарные в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Элегантные будуарные пуфы для спальни и интерьера. Мягкое сиденье и стильная форма",
  },

  {
    id: 3,
    title: "Туалетные столики",
    kg:"Косметикалык столдор",
    price: 16000,
    images: [
      "images/Туалетные столики/Столик 2.jpg",
      "images/Туалетные столики/Столик 3.jpg",
      "images/Туалетные столики/Столик 1.jpg",
      "images/Туалетные столики/Столик 4.jpg",
      "images/Туалетные столики/Столик 5.jpg",
      "images/Туалетные столики/Столик 6.jpg",
      "images/Туалетные столики/Столик 7.jpg",
      "images/Туалетные столики/Столик 8.jpg",
      "images/Туалетные столики/Столик 9.jpg",
      "images/Туалетные столики/Столик 10.jpg",
      "images/Туалетные столики/Столик 11.jpg"
    ],
    description: "Стильные туалетные столики для спальни с удобными ящиками и современным дизайном.",
descriptionKg: "Уктоочу бөлмө үчүн стилдүү косметикалык столдор. Ыңгайлуу тартмалары жана заманбап дизайны бар.",

material: "ЛДСП, фурнитура",
materialKg: "ЛДСП, фурнитура",

frame: "ЛДСП каркас",
frameKg: "ЛДСП каркас",

style: "Современный",
styleKg: "Заманбап",

color: "Разные варианты",
colorKg: "Ар түрдүү варианттар",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
    keywords: ["туалетный столик", "туалетные столики", "столик"],

    seoTitle: "Туалетные столики в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Стильные туалетные столики для спальни с удобными ящиками и современным дизайном",
  },

  {
    id: 4,
    title: "Кровати",
    kg:"Керебеттер",
    price: 43500,
    images: [
      "images/Кровати/Кровать 1.jpg",
      "images/Кровати/Кровать 2.jpg",
      "images/Кровати/Кровать 3.jpg",
      "images/Кровати/Кровать 4.jpg",
      "images/Кровати/Кровать 5.jpg",
      "images/Кровати/Кровать 6.jpg"
    ],
    description: "Мягкие современные кровати для комфортного сна. Прочная конструкция и красивый дизайн.",
descriptionKg: "Ыңгайлуу уктоо үчүн заманбап жумшак керебеттер. Бекем түзүлүш жана кооз дизайн.",

material: "Велюр, ткань, наполнитель",
materialKg: "Велюр, кездеме, толтургуч",

frame: "Дерево, ЛДСП",
frameKg: "Жыгач, ЛДСП",

style: "Современный",
styleKg: "Заманбап",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан", 
    keywords: ["кровать", "кровати", "кроват"],

    seoTitle: "Кровати в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Мягкие современные кровати для комфортного сна. Прочная конструкция и красивый дизайн",
  },


  {
  id: 5,
  title: "Консоли",
  kg:"Консолдор",
  price: 43500,
  images: [
    "images/Консоли/Консоль 1.jpg",
    "images/Консоли/Консоль 2.jpg",
    "images/Консоли/Консоль 6.jpg",
    "images/Консоли/Консоль 3.jpg",
    "images/Консоли/Консоль 4.jpg",
    "images/Консоли/Консоль 5.jpg",
  ],
  description: "Современные консоли для прихожей, спальни и салона красоты.",
descriptionKg: "Коридор, уктоочу бөлмө жана сулуулук салону үчүн заманбап консольдор.",

material: "ЛДСП, фурнитура",
materialKg: "ЛДСП, фурнитура",

frame: "ЛДСП каркас",
frameKg: "ЛДСП каркас",

style: "Минимализм",
styleKg: "Минимализм",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["консоль", "консоли"],

  seoTitle: "Консоли в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Современные консоли для прихожей, спальни и салона красоты",
},

{
  id: 6,
  title: "Кресла и стулья",
  kg:"Креслолор жана отургучтар",
  price: 23500,
  images: [
    "images/Кресла и стулья/Стул 1.jpg",
    "images/Кресла и стулья/Стул 2.jpg",
    "images/Кресла и стулья/Стул 3.jpg",
    "images/Кресла и стулья/Стул 4.jpg",
    "images/Кресла и стулья/Стул 5.jpg",
    "images/Кресла и стулья/Стул 6.jpg"
  ],
  description: "Мягкие кресла и стулья для дома с удобной посадкой.",
descriptionKg: "Үй үчүн ыңгайлуу жумшак креслолор жана отургучтар.",

material: "Ткань, поролон",
materialKg: "Кездеме, поролон",

frame: "Металл, дерево",
frameKg: "Металл, жыгач",

style: "Современный",
styleKg: "Заманбап",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["кресло", "кресла", "стул", "стулья", "стулья и кресла"],

  seoTitle: "Кресла и стулья в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Мягкие кресла и стулья для дома с удобной посадкой",
},

{
  id: 7,
  title: "Диваны",
  kg:"Дивандар",
  price: 23500,
  images: [
    "images/Диваны/Диван 1.jpg",
    "images/Диваны/Диван 2.jpg",
    "images/Диваны/Диван 3.jpg",
    "images/Диваны/Диван 4.jpg",
    "images/Диваны/Диван 5.jpg",
    "images/Диваны/Диван 6.jpg",
    "images/Диваны/Диван 7.jpg",
    "images/Диваны/Диван 8.jpg",
    "images/Диваны/Диван 9.jpg"
  ],
  description: "Удобные современные диваны для дома и офиса. Мягкие сиденья, прочная конструкция и стильный внешний вид обеспечивают комфорт на каждый день.",
descriptionKg: "Үй жана кеңсе үчүн ыңгайлуу заманбап дивандар. Жумшак отургучтары, бекем түзүлүшү жана кооз дизайны күнүмдүк ыңгайлуулукту камсыз кылат.",

material: "Велюр, качественная ткань",
materialKg: "Велюр, сапаттуу кездеме",

frame: "Деревянный каркас, ЛДСП",
frameKg: "Жыгач каркас, ЛДСП",

style: "Современный",
styleKg: "Заманбап",

color: "Разные цвета на выбор",
colorKg: "Ар түрдүү түстөр тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["диван", "диваны"],

  seoTitle: "Диваны в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Удобные современные диваны для дома и офиса. Мягкие сиденья, прочная конструкция и стильный внешний вид обеспечивают комфорт на каждый день",
},

{
  id: 8,
  title: "Тумбы",
  kg:"Тумбалар",
  price: 23500,
  images: [
    "images/Тумбы/Тумба 1.jpg",
    "images/Тумбы/Тумба 2.jpg",
    "images/Тумбы/Тумба 3.jpg",
    "images/Тумбы/Тумба 4.jpg",
    "images/Тумбы/Тумба 5.jpg"
  ],
  description: "Практичные и стильные тумбы для хранения вещей. Отлично подходят для спальни, гостиной и других помещений.",
descriptionKg: "Буюмдарды сактоо үчүн ыңгайлуу жана стилдүү тумбалар. Уктоочу бөлмөгө, конок бөлмөгө жана башка жайларга ылайыктуу.",

material: "ЛДСП, мебельная фурнитура",
materialKg: "ЛДСП, мебель фурнитурасы",

frame: "ЛДСП каркас",
frameKg: "ЛДСП каркас",

style: "Современный",
styleKg: "Заманбап",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["тумба", "тумбы"],

  seoTitle: "Тумбы в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Практичные и стильные тумбы для хранения вещей. Отлично подходят для спальни, гостиной и других помещений",
},

{
  id: 9,
  title: "Столики",
  kg:"Столиктер",
  price: 23500,
  images: [
    "images/Столики/Столики 1.jpg",
    "images/Столики/Столики 2.jpg",
    "images/Столики/Столики 3.jpg",
    "images/Столики/Столики 5.jpg",
    "images/Столики/Столики 6.jpg",
    "images/Столики/Столик 7.jpg",
    "images/Столики/Столик 8.jpg",
    "images/Столики/Столик 9.jpg",
    "images/Столики/Столик 10.jpg",
    "images/Столики/Столик 11.jpg",
    "images/Столики/Столик 12.jpg"
  ],
  description: "Декоративные и журнальные столики для современного интерьера. Подходят для гостиной, спальни и зоны отдыха.",
descriptionKg: "Заманбап интерьер үчүн декоративдүү жана журналдык столиктер. Конок бөлмөгө, уктоочу бөлмөгө жана эс алуу жайына ылайыктуу.",

material: "ЛДСП, металл",
materialKg: "ЛДСП, металл",

frame: "Металлический каркас",
frameKg: "Металл каркас",

style: "Минимализм",
styleKg: "Минимализм",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["столик", "столики"],

  seoTitle: "Столики в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Декоративные и журнальные столики для современного интерьера. Подходят для гостиной, спальни и зоны отдыха",
},

{
  id: 10,
  title: "Пуфы",
  kg:"Пуфтар",
  price: 23500,
  images: [
    "images/Пуфы/Пуф 1.jpg",
    "images/Пуфы/Пуф 2.jpg",
    "images/Пуфы/Пуф 3.jpg"
  ],
  description: "Компактные мягкие пуфы для спальни, прихожей и зоны отдыха. Удобны как дополнительное место для сидения.",
descriptionKg: "Уктоочу бөлмө, коридор жана эс алуу жайы үчүн жумшак жана ыңгайлуу пуфтар. Кошумча отургуч катары колдонууга ылайыктуу.",

material: "Велюр, ткань, поролон",
materialKg: "Велюр, кездеме, поролон",

frame: "Деревянный каркас",
frameKg: "Жыгач каркас",

style: "Современный",
styleKg: "Заманбап",

color: "Разные цвета",
colorKg: "Ар түрдүү түстөр",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["пуф", "пуфы"],

  seoTitle: "Пуфы в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Компактные мягкие пуфы для спальни, прихожей и зоны отдыха. Удобны как дополнительное место для сидения",
},

{
  id: 11,
  title: "Подвесные консоли",
  kg:"Илме консолдор",
  price: 23500,
  images: [
    "images/Подвесные консоли/Консоль 2.jpg",
    "images/Подвесные консоли/Консоль 3.jpg",
    "images/Подвесные консоли/Консоль 4.jpg",
    "images/Подвесные консоли/Консоль 5.jpg",
    "images/Подвесные консоли/Консоль 6.jpg",
    "images/Подвесные консоли/Консоль 1.jpg",
  ],
  description: "Современные подвесные консоли для прихожей, спальни и салона красоты. Экономят пространство и украшают интерьер.",
descriptionKg: "Коридор, уктоочу бөлмө жана сулуулук салону үчүн заманбап илме консольдор. Орун үнөмдөйт жана интерьерди кооздойт.",

material: "ЛДСП, мебельная фурнитура",
materialKg: "ЛДСП, мебель фурнитурасы",

frame: "ЛДСП каркас",
frameKg: "ЛДСП каркас",

style: "Минимализм",
styleKg: "Минимализм",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["подвесная консоль", "подвесные консоли", "консоль"],

  seoTitle: "Подвесные консоли в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Современные подвесные консоли для прихожей, спальни и салона красоты. Экономят пространство и украшают интерьер",
},

{
  id: 12,
  title: "Прикроватные тумбы",
  kg:"Керебет жанындагы тумбалар",
  price: 21000,
  images: [
    "images/Прикроватные тумбы/Тумба 1.jpg",
    "images/Прикроватные тумбы/Тумба 2.jpg",
    "images/Прикроватные тумбы/Тумба 3.jpg",
    "images/Прикроватные тумбы/Тумба 4.jpg",
    "images/Прикроватные тумбы/Тумба 5.jpg",
    "images/Прикроватные тумбы/Тумба 6.jpg",
    "images/Прикроватные тумбы/Тумба 7.jpg"
  ],
  description: "Удобные прикроватные тумбы для хранения необходимых вещей рядом с кроватью. Компактные и практичные.",
descriptionKg: "Керебеттин жанында колдонууга ыңгайлуу тумбалар. Керектүү буюмдарды сактоо үчүн ылайыктуу жана практикалык.",

material: "ЛДСП, мебельная фурнитура",
materialKg: "ЛДСП, мебель фурнитурасы",

frame: "ЛДСП каркас",
frameKg: "ЛДСП каркас",

style: "Современный",
styleKg: "Заманбап",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["прикроватная тумба", "прикроватные тумбы", "тумба"],

  seoTitle: "Прикроватные в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Удобные прикроватные тумбы для хранения необходимых вещей рядом с кроватью. Компактные и практичные",
},

{
  id: 13,
  title: "ТВ-Тумбы",
  kg:"ТВ тумбалар",
  price: 21000,
  images: [
    "images/ТВ тумбы/Тумба 1.jpg",
    "images/ТВ тумбы/Тумба 2.jpg",
    "images/ТВ тумбы/Тумба 3.jpg",
    "images/ТВ тумбы/Тумба 4.jpg"
  ],
  description: "Современные ТВ-тумбы для размещения телевизора и хранения аксессуаров. Идеально подходят для гостиной комнаты.",
descriptionKg: "Телевизорду жайгаштыруу жана аксессуарларды сактоо үчүн заманбап ТВ тумбалар. Конок бөлмөгө эң ылайыктуу.",

material: "ЛДСП, мебельная фурнитура",
materialKg: "ЛДСП, мебель фурнитурасы",

frame: "ЛДСП каркас",
frameKg: "ЛДСП каркас",

style: "Современный",
styleKg: "Заманбап",

color: "На выбор",
colorKg: "Тандоо боюнча",

guarantee: "12 месяцев",
guaranteeKg: "12 ай",

country: "Кыргызстан",
countryKg: "Кыргызстан",
  keywords: ["тв тумба", "тв тумбы", "телевизионная тумба", "тумба"],

  seoTitle: "ТВ-Тумбы в Бишкеке Кыргызстан — Beauty Home",
seoDescription: "Современные ТВ-тумбы для размещения телевизора и хранения аксессуаров. Идеально подходят для гостиной комнаты",
}
];

products.forEach(product => {

  product.keywords = [
    ...(product.keywords || []),
    product.title,
    product.kg || ""
  ];

});
